In [1]:
import pandas as pd

In [2]:
file_path = './data/exam_sample.csv'
df = pd.read_csv(file_path, encoding='euc-kr')
df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [4]:
print(df['math'].min())
print(df['math'].max())

20
90

In [6]:
# cut() : 특정 데이터를 동일한 간격으로 구분할때 사용 
pd.cut(df['math'],3) # 균등한 범위로 3구간으로 범위 나눈다

0    (43.333, 66.667]
1    (43.333, 66.667]
2    (43.333, 66.667]
3     (19.93, 43.333]
4      (66.667, 90.0]
5    (43.333, 66.667]
6      (66.667, 90.0]
7      (66.667, 90.0]
8     (19.93, 43.333]
9    (43.333, 66.667]
Name: math, dtype: category
Categories (3, interval[float64, right]): [(19.93, 43.333] < (43.333, 66.667] < (66.667, 90.0]]

In [8]:
df1 = pd.cut(df['math'],3,labels = False) # labels = False 구간으로 표현 
df1

0    1
1    1
2    1
3    0
4    2
5    1
6    2
7    2
8    0
9    1
Name: math, dtype: int64

In [17]:
df2 = df['math'].groupby(df1)
df2.head() 
df2.head(2) # 0구간에 속해있는값 2개 , 1구간에 속해있는값 2개 , 2구간에 속해있는 값 2개 출력

0    50
1    60
3    30
4    90
6    80
8    20
Name: math, dtype: int64

In [18]:
df2.agg(['count','mean','std','min','max'])

      count       mean       std  min  max
math
0         2  25.000000  7.071068   20   30
1         5  51.000000  5.477226   45   60
2         3  86.666667  5.773503   80   90

In [20]:
# 유사한 값들끼리 5구간으로 나누기 균등X
pd.qcut(df['math'], 5)

0      (42.0, 50.0]
1      (54.0, 82.0]
2      (42.0, 50.0]
3    (19.999, 42.0]
4      (82.0, 90.0]
5      (42.0, 50.0]
6      (54.0, 82.0]
7      (82.0, 90.0]
8    (19.999, 42.0]
9      (42.0, 50.0]
Name: math, dtype: category
Categories (5, interval[float64, right]): [(19.999, 42.0] < (42.0, 50.0] < (50.0, 54.0] < (54.0, 82.0] < (82.0, 90.0]]

In [22]:
pd.qcut(df['math'],5,labels=False)

0    1
1    3
2    1
3    0
4    4
5    1
6    3
7    4
8    0
9    1
Name: math, dtype: int64